from django.http import HttpResponse
from django.shortcuts import render

from tovaru.models import Categories

def index(request):


    context = {
        'title': 'Home - Головна',
        'content': 'Магазин вентиляційної продукції',
    }

    return render(request, 'main/index.html', context)


def about(request):
    context = {
        'title': 'Home - Про нас',
        'content': 'Про нас',
        'text_on_page': "Забезпечення виробничих і побутових приміщень системою вентиляції — одна з головних завдань ще на етапі проектування. Особливо важливо правильно облаштувати вентиляцію у сфері виробництва, пов'язаної з підвищеними температурами, агресивними середовищами, високою вологістю. Зокрема, якісна вентиляція обов'язкова для витяжки на кухні громадського харчування, у виробничих цехах. Та й вдома відмінна циркуляція повітря — це природна потреба, особливо для лазні, для котлів в приватному будинку і для гаражів. Для того щоб система повітрообміну була продуктивною і справно виконувала поставлені завдання, недостатньо купити якісний вентилятор. Необхідні також додаткові аксесуари, які покращують процес витяжки відпрацьованих повітряних мас, очищення приміщення від неприємних запахів, створюючи сприятливу атмосферу в приватному будинку, квартирі, на роботі. Комплектуючі для припливною, витяжною системи представлені широким асортиментом. Вибір необхідної конструкції здійснюється з урахуванням експлуатаційних особливостей будівлі, повітропроводів."
        
    }

    return render(request, 'main/about.html', context)
